app/Controllers/Absen.php

SELECT *
FROM `siswa`
WHERE `status` = 'active'
SELECT *
FROM `absen`
WHERE `id_siswa` = '15115'
AND `tanggal` = '2025-03-12'
 LIMIT 1
---
    public function index()
    {
        $siswaAktif = $this->siswaModel->where('status', 'active')->findAll();

        $tanggal = date('Y-m-d');
        foreach ($siswaAktif as $siswa) {
            $absensiHariIni = $this->absensiModel->where(['id_siswa' => $siswa['id_siswa'], 'tanggal' => $tanggal])->first();

SELECT *
FROM `siswa`
WHERE `siswa`.`id_siswa` = '25'
SELECT *
FROM `absen`
WHERE `id_siswa` = '25'
AND `tanggal` = '2025-03-12'
 LIMIT 1
---
    public function absensi()
    {
        $id_siswa = $this->request->getPost('id_siswa');
        $tanggal = date('Y-m-d');

        $siswa = $this->siswaModel->find($id_siswa);
        if (!$siswa) {
            session()->setFlashdata('error', 'Siswa tidak ditemukan.<br>Periksa kembali NIS');
            return redirect()->to('/');
        }
        if ($siswa['status'] !== 'active') {
            session()->setFlashdata('error', esc($siswa['nama']) . '<br> tidak dapat melakukan absensi karena sudah selesai prakerin.');
            return redirect()->to('/');
        }

        $absensi = $this->absensiModel->where(['id_siswa' => $id_siswa, 'tanggal' => $tanggal])->first();

SELECT `absen`.`id_siswa`, `siswa`.`nama`, `siswa`.`sekolah`, `absen`.`waktu`
FROM `absen`
JOIN `siswa` ON `siswa`.`id_siswa` = `absen`.`id_siswa`
WHERE `absen`.`keterangan` = 'Hadir'
AND `absen`.`tanggal` = '2025-03-05'
SELECT `siswa`.`id_siswa`, `siswa`.`nama`, `siswa`.`sekolah`
FROM `siswa`
LEFT JOIN `absen` ON `absen`.`id_siswa` = `siswa`.`id_siswa`
WHERE `absen`.`keterangan` = 'Alpa'
AND `absen`.`tanggal` = '2025-03-05'
---
    public function kehadiran()
    {
        $tanggal = $this->request->getGet('tanggal') ?? date('Y-m-d');

        $sudah_absen = $this->absensiModel
            ->select('absen.id_siswa, siswa.nama, siswa.sekolah, absen.waktu')
            ->join('siswa', 'siswa.id_siswa = absen.id_siswa')
            ->where('absen.keterangan', 'Hadir')
            ->where('absen.tanggal', $tanggal)
            ->findAll();

        $belum_absen = $this->siswaModel
            ->select('siswa.id_siswa, siswa.nama, siswa.sekolah')
            ->join('absen', 'absen.id_siswa = siswa.id_siswa', 'left')
            ->where('absen.keterangan', 'Alpa')
            ->where('absen.tanggal', $tanggal)
            ->findAll();