app/Models/Absen_model.php

    public function insertAbsensi($data)
    {
        return $this->insert($data);
---
INSERT INTO `absen` (`id_siswa`, `tanggal`, `keterangan`, `waktu`) VALUES ('15115', '2025-03-12', 'Alpa', NULL)

    public function updateAbsensi($id_siswa, $tanggal)
    {
        return $this->set('keterangan', 'Hadir')
                    ->set('waktu', date('H:i:s'))
                    ->where(['id_siswa' => $id_siswa, 'tanggal' => $tanggal])
                    ->update();
---
UPDATE `absen` SET `keterangan` = 'Hadir', `waktu` = '10:25:41'
WHERE `id_siswa` = '25'
AND `tanggal` = '2025-03-12'

    public function getAbsensiByDate($tanggal)
    {
        return $this->select('absen.id_siswa, siswa.nama, siswa.sekolah, absen.waktu')
        ->join('siswa', 'siswa.id_siswa = absen.id_siswa')
        ->where('absen.keterangan', 'Hadir')
        ->where('absen.tanggal', $tanggal)
        ->orderBy('absen.waktu', 'ASC')
        ->findAll();
---
SELECT `absen`.`id_siswa`, `siswa`.`nama`, `siswa`.`sekolah`, `absen`.`waktu`
FROM `absen`
JOIN `siswa` ON `siswa`.`id_siswa` = `absen`.`id_siswa`
WHERE `absen`.`keterangan` = 'Hadir'
AND `absen`.`tanggal` = '2025-03-12'
ORDER BY `absen`.`waktu` ASC