app/Models/Siswa_model.php

SELECT *
FROM `siswa`
---
    public function getSiswa($id = false)
    {
        if ($id === false) {
            return $this->findAll();